; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v7)
		(pred_2 ?v1)
		(pred_4 ?v8)
		(pred_1 ?v8)
		(pred_5 ?v1 ?v8)
		(pred_6)
		(pred_3 ?v1))

   (:action op_1
       :parameters  (?v3 ?v5)
       :precondition (and (not-eq ?v3 ?v5) 
                          (pred_4 ?v3) (pred_4 ?v5) (pred_1 ?v3))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v3))))


   (:action op_2
       :parameters (?v2 ?v4)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v4)
			    (pred_5 ?v2 ?v4) (pred_1 ?v4) (pred_6))
       :effect (and (pred_3 ?v2)
		    (not (pred_5 ?v2 ?v4)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v2  ?v4)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v4)
			    (pred_3 ?v2) (pred_1 ?v4))
       :effect (and (pred_5 ?v2 ?v4)
		    (pred_6)
		    (not (pred_3 ?v2)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_04 obj_03 obj_05 obj_01 obj_09 obj_07 
          obj_02 obj_06 obj_08 
)
(:init
(pred_4 obj_04)
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_01)
(pred_4 obj_09)
(pred_4 obj_07)
(pred_2 obj_02)
(pred_2 obj_06)
(pred_2 obj_08)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(pred_6)
(pred_5 obj_02 obj_03)
(pred_5 obj_06 obj_07)
(pred_5 obj_08 obj_09)
(pred_1 obj_09)
)
(:goal
(and
(pred_5 obj_02 obj_03)
(pred_5 obj_06 obj_07)
(pred_5 obj_08 obj_04)
)
)

(:constraints
  (sometime-before  (pred_5 obj_08 obj_04) (pred_1 obj_03))
)
)

; plan
1. (op_1 obj_09 obj_03)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_03)
   goals met: 2 of 3
2. (op_2 obj_02 obj_03)
   deleted: (pred_5 obj_02 obj_03) (pred_6)
   added: (pred_3 obj_02)
   goals met: 1 of 3
3. (op_1 obj_03 obj_09)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_09)
   goals met: 1 of 3
4. (op_3 obj_02 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_5 obj_02 obj_09) (pred_6)
   goals met: 1 of 3
5. (op_2 obj_08 obj_09)
   deleted: (pred_5 obj_08 obj_09) (pred_6)
   added: (pred_3 obj_08)
   goals met: 1 of 3
6. (op_1 obj_09 obj_04)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_04)
   goals met: 1 of 3
7. (op_3 obj_08 obj_04)
   deleted: (pred_3 obj_08)
   added: (pred_5 obj_08 obj_04) (pred_6)
   goals met: 2 of 3
8. (op_1 obj_04 obj_09)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_09)
   goals met: 2 of 3
9. (op_2 obj_02 obj_09)
   deleted: (pred_5 obj_02 obj_09) (pred_6)
   added: (pred_3 obj_02)
   goals met: 2 of 3
10. (op_1 obj_09 obj_03)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_03)
   goals met: 2 of 3
11. (op_3 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_5 obj_02 obj_03) (pred_6)
   goals met: 3 of 3
